[
    {
        "pub-date": "26/07/2006",
        "episode": "01",
        "title": "Alexander versus Hitler",
        "description": "Dan compares the way the modern world sees Adolf Hitler with the way history views Alexander the Great and wonders if the two men weren’t more alike than different."
    },
    {
        "pub-date": "26/09/2006",
        "episode": "02",
        "title": "Guns and Horses",
        "description": "The West is Mike Tyson and the East is Muhammad Ali in this episode as Dan mixes Art Bell, with Hans Delbruck in this look at a possible reason for the military decline of the near East."
    },
    {
        "pub-date": "04/10/2006",
        "episode": "03",
        "title": "The Organization of Peace",
        "description": "The early 20th century League of Nations stood for peace, cooperation, disarmament and international understanding. What happened?"
    },
    {
        "pub-date": "24/10/2006",
        "episode": "04",
        "title": "Romancing The Tribes",
        "description": "Native American chief Tecumseh and Gallic king Vercingetorix both tried to unify their tribal peoples to face overwhelming foes. Dan examines the romance of their lost causes."
    },
    {
        "pub-date": "14/11/2006",
        "episode": "05",
        "title": "Meandering Through The Cold War",
        "description": "Dan meanders through a conversation about causes and effects of the Cold War without ever talking much about the actual events of the conflict."
    },
    {
        "pub-date": "08/12/2006",
        "episode": "06",
        "title": "Shield of the West",
        "description": "Spartans, Athenians, Persians and references to Star Trek all make appearances in this look at the dramatic and extremely consequential Greek and Persian wars."
    },
    {
        "pub-date": "27/12/2006",
        "episode": "07",
        "title": "The X-History Files",
        "description": "Napoleon is supposed to have said that “History is a set of lies agreed upon”. With that in mind, Dan looks at some of the alternative and pseudo history ideas that many people embrace."
    },
    {
        "pub-date": "27/01/2007",
        "episode": "08",
        "title": "Scars of the Great War",
        "description": "Dan looks at the shock and awe caused by the First World War and marvels at how connected we still are to the empire-shattering effects of the conflict contemporaries simply referred to as The Great War."
    },
    {
        "pub-date": "16/02/2007",
        "episode": "09",
        "title": "Darkness Buries the Bronze Age",
        "description": "What was the cause of the collapse of the Bronze Age? War? Famine? Natural disaster? Sauron the Dark Lord? Dan looks at all the potential villains…except for Sauron."
    },
    {
        "pub-date": "13/03/2007",
        "episode": "10",
        "title": "The What-Ifs of 1066",
        "description": "How might history have been changed if the events of the momentous year 1066 had turned out differently? Dan examines Normans, Vikings, Saxons, Bastards, Conquerers, Confessors, Godwinsons and Hardratas."
    },
    {
        "pub-date": "11/04/2007",
        "episode": "11",
        "title": "Thoughts on Churchill",
        "description": "We almost called this show “Things about Churchill that have interested Dan”. Dan takes a look at various elements of the dramatic life and career of the great British leader."
    },
    {
        "pub-date": "08/05/2007",
        "episode": "12",
        "title": "Steppe Stories",
        "description": "Blood-sucking Scythian warriors, tattooed ice mummies, Amazons killing so they can mate, pot smoking head-hunters, scalp-taking, koumiss-drinking Mongols, Turks, Huns, and Aliens. What’s not to like?"
    },
    {
        "pub-date": "13/06/2007",
        "episode": "13",
        "title": "Bubonic Nukes",
        "description": "What would happen if half the population died in a short period of time? Dan looks at the Black Death and other plagues that created almost apocalyptic conditions in the past…and maybe in the future."
    },
    {
        "pub-date": "18/07/2007",
        "episode": "14",
        "title": "The Macedonian Soap Opera",
        "description": "When Alexander the Great bequeathed his empire “to the strongest” he set off a funeral contest that shook the world for decades. Murder, marriage, intrigue,and drama all feature prominently in the story."
    },
    {
        "pub-date": "30/08/2007",
        "episode": "15",
        "title": "Desperate Times",
        "description": "The tough economic climate after the First World War fostered the growth of radicalism around the world. Did it also create tougher people? Dan looks at the connection between tough times and the “Greatest Generation”."
    },
    {
        "pub-date": "17/10/2007",
        "episode": "16",
        "title": "Nazi Tidbits",
        "description": "What accounts for the fascination people still have with Adolf Hitler and the Nazis? Dan looks at some of the ideas of the German National Socialists and examines the demonic, charismatic Nazi Fuhrer."
    },
    {
        "pub-date": "14/12/2007",
        "episode": "17",
        "title": "Judgment at Nineveh",
        "description": "Will our modern society ever decline and fall? Dan uses that idea as a backdrop for a look at the first great empire in history, the biblical-era Assyrians. Were they ancient Nazis, or the guardians of civilization?"
    },
    {
        "pub-date": "02/01/2008",
        "episode": "18",
        "title": "A Fly on James Burke's Wall",
        "description": "In this episode, Dan discusses history with famed television host, author and science historian James Burke, the man the Washington Post called “one of the most intriguing minds in the Western world”."
    },
    {
        "pub-date": "14/03/2008",
        "episode": "19",
        "title": "Apache Tears",
        "description": "A traumatized people who traumatized their neighbors, the Native American tribe known as Apache were among the last Indians to surrender to the U.S. Government. Dan, of course, has thoughts. This is a long show!"
    },
    {
        "pub-date": "06/05/2008",
        "episode": "20",
        "title": "(BLITZ) History Under the Influence",
        "description": "This first “Blitz Edition” of the show looks at the hidden side of history, the impact of drugs and alcohol on past events. Dan has a whole list of historical figures he wants to drug test."
    },
    {
        "pub-date": "27/07/2008",
        "episode": "21",
        "title": "Punic Nightmares I",
        "description": "Was it geopolitics or simply bitter hatred that fueled the ancient bloodbaths known as “The Punic Wars”? Dan highlights the unimaginable things people experienced during this intense face-off between Rome and Carthage."
    },
    {
        "pub-date": "18/09/2008",
        "episode": "22",
        "title": "Punic Nightmares II",
        "description": "Darkness, horror, war and carnage dominate Part 2 of the Punic War trilogy as Hannibal rampages across Italy and pushes Rome to the brink of doom."
    },
    {
        "pub-date": "30/10/2008",
        "episode": "23",
        "title": "Punic Nightmares III",
        "description": "In one of the great displays of resiliency in all history, the Romans refuse to buckle under murderous Carthaginian pressure. Instead they recover, defeat and destroy Carthage, and conquer most of the Mediterranean."
    },
    {
        "pub-date": "21/11/2008",
        "episode": "24",
        "title": "Classical Hanson",
        "description": "Dan discusses history with famed historian, political commentator and classicist Victor Davis Hanson."
    },
    {
        "pub-date": "20/01/2009",
        "episode": "25",
        "title": "The Dyer Outlook",
        "description": "Dan discusses the past, present and future with influential Canadian historian, broadcaster and columnist Gwynne Dyer."
    },
    {
        "pub-date": "03/02/2009",
        "episode": "26",
        "title": "(BLITZ) Addicted to Bondage",
        "description": "Is slavery a natural feature of human societies? Dan looks at this timeless, evil institution and wonders if we have made as much progress freeing ourselves from its influence as we think we have."
    },
    {
        "pub-date": "19/04/2009",
        "episode": "27",
        "title": "Ghosts of the Ostfront I",
        "description": "Part One covering the conflict between the Germans and the Soviet Union in the Second World War. Dan gives an introduction to the subject and discusses the causes and opening moves of Operation Barbarossa."
    },
    {
        "pub-date": "17/06/2009",
        "episode": "28",
        "title": "Ghosts of the Ostfront II",
        "description": "In Part Two of the Ostfront series covering WW2 on the Eastern Front, Dan looks at the attempt to take Moscow and the many compelling stories surrounding the momentous1941 German offensive."
    },
    {
        "pub-date": "10/08/2009",
        "episode": "29",
        "title": "Ghosts of the Ostfront III",
        "description": "In Part Three of the Ostfront series covering WW2 on the Eastern Front, Dan looks at the situation in the U.S.S.R. during 1942 and early 1943, including the dreadful Battle of Stalingrad."
    },
    {
        "pub-date": "10/10/2009",
        "episode": "30",
        "title": "Ghosts of the Ostfront IV",
        "description": "In the final episode of the horror story that is the Eastern Front the tale descends into unimaginable darkness as vengeance is called down on Germany. This graphic episode is not for young ears."
    },
    {
        "pub-date": "09/12/2009",
        "episode": "31",
        "title": "(BLITZ) Suffer the Children",
        "description": "Dan’s exposure to the idea of “psychohistory” gets him thinking about how children were raised in the past. Could widespread child abuse and bad parenting in earlier eras explain some of history’s brutality?"
    },
    {
        "pub-date": "27/02/2010",
        "episode": "32",
        "title": "Globalization Unto Death",
        "description": "Ferdinand Magellan is the lead character in this episode about the collision between the Old and New worlds and what Dan calls “Globalization 1.0″. It is also full of controversy!"
    },
    {
        "pub-date": "27/04/2010",
        "episode": "33",
        "title": "(BLITZ) Old School Toughness",
        "description": "Does the toughness of peoples play any role in history? How can historians deal with such an amorphous human quality? Historiography, boxing, barbarians, philosophy and wisdom are among the subjects touched upon"
    },
    {
        "pub-date": "28/06/2010",
        "episode": "34",
        "title": "Death Throes of the Republic I",
        "description": "The wars which elevate Rome to superpower status also sow the seed for the downfall of its political system. Money, slaves, ambition, political stalemate and class warfare prove to be a toxic, bloody mix"
    },
    {
        "pub-date": "29/08/2010",
        "episode": "35",
        "title": "Death Throes of the Republic II",
        "description": "Disaster threatens the Republic, but the cure might be worse than the disease. “The Dan Carlin version” of this story continues with ambition-addict Marius dominating the story and Plutarch dominating the sources."
    },
    {
        "pub-date": "31/10/2010",
        "episode": "36",
        "title": "Death Throes of the Republic III",
        "description": "Rome’s political violence expands in intensity from riots and assassinations to outright war as the hyper-ambitious generals Marius and Sulla tear the Republic and its constitution apart vying for power and glory."
    },
    {
        "pub-date": "28/01/2011",
        "episode": "37",
        "title": "Death Throes of the Republic IV",
        "description": "Sulla returns to Rome to show the Republic what REAL political violence looks like. Civil war and deadly partisan payback will pave the way for reforms pushed at sword point. Lots of heads will roll…literally."
    },
    {
        "pub-date": "01/04/2011",
        "episode": "38",
        "title": "Death Throes of the Republic V",
        "description": "The last great generation of the Roman Republic emerges from the historical mists. The dynamic between Caesar, Cato, Cicero, Crassus and Pompey forms the axis around which the rest of this tale revolves."
    },
    {
        "pub-date": "30/06/2011",
        "episode": "39",
        "title": "Death Throes of the Republic VI",
        "description": "In a massive finish to the “Dan Carlin version” of the fall of the Roman Republic, conspiracies, civil wars, beatniks of antiquity and a guy named Caesar figure prominently. Virtually everyone dies."
    },
    {
        "pub-date": "13/10/2011",
        "episode": "40",
        "title": "(BLITZ) Radical Thoughts",
        "description": "Using the two 20th Century “Red Scare” eras as case studies, Dan looks at the fear that can be generated by potentially dangerous ideas and examines the way such powerful mass emotions can butt human judgment."
    },
    {
        "pub-date": "19/01/2012",
        "episode": "41",
        "title": "Thor's Angels",
        "description": "What started as a standard podcast episode morphed into an audio book on what used to be called “The Dark Ages” in Europe. Dan gets into many areas he should probably avoid…Gods, Germans, bikers, Jesus…"
    },
    {
        "pub-date": "19/01/2012",
        "episode": "41B",
        "title": "(EXTRA) Thor's Angels",
        "description": "More military history. More quintessentially “Dan” twists. More deep questions. In this “Director’s Cut” style addendum to HH 41 you get all that, plus cutting-room floor stuff and Dan talking about the challenges this episode posed and why he made Thor’s Angels the way he did."
    },
    {
        "pub-date": "31/03/2012",
        "episode": "42",
        "title": "(BLITZ) Logical Insanity",
        "description": "After many listener requests, Dan examines the issue of the morality of dropping the Atomic Bombs in the Second World War. As usual, he does so in his own unique, unexpected way."
    },
    {
        "pub-date": "31/03/2012",
        "episode": "42B",
        "title": "(EXTRA) Logical Insanity",
        "description": "More military history. More quintessentially “Dan” twists. More deep questions. In this “Director’s Cut” style addendum to HH 42 you get all that, plus cutting-room floor stuff and Dan talking about the challenges this episode posed and why he made “Logical Insanity” the way he did."
    },
    {
        "pub-date": "14/06/2012",
        "episode": "43",
        "title": "Wrath of the Khans I",
        "description": "In one of the most violent outbursts in history a little-known tribe of Eurasian nomads breaks upon the great societies of the Old World like a human tsunami. It may have ushered in the modern era, but at what cost?"
    },
    {
        "pub-date": "31/07/2012",
        "episode": "44",
        "title": "Wrath of the Khans II",
        "description": "The Mongol leader Genghis Khan displays an unmatched level of strategic genius while moving against both Northern China and the Eastern Islamic world. Both civilizations are left stunned and millions are slaughtered."
    },
    {
        "pub-date": "23/09/2012",
        "episode": "45",
        "title": "Wrath of the Khans III",
        "description": "The expansion of Genghis Khan’s conquests continue, with locations as far apart as Europe and China feeling the bloody effects of Mongol warfare and retribution. Can anything halt the carnage?"
    },
    {
        "pub-date": "13/11/2012",
        "episode": "46",
        "title": "Wrath of the Khans IV",
        "description": "The death of Genghis Khan, the founder of the Mongol Empire, should have slowed the momentum of Mongol conquests, but instead it accelerated it. This time though, all of Europe is on the Mongol hit list."
    },
    {
        "pub-date": "13/01/2013",
        "episode": "47",
        "title": "Wrath of the Khans V",
        "description": "Succession issues weaken the Mongol Empire as the grandchildren of Genghis Khan fight over their imperial inheritance. This doesn’t stop them from dealing out pain, suffering, and ironically good governance while doing so."
    },
    {
        "pub-date": "13/01/2013",
        "episode": "47B",
        "title": "(EXTRA) Wrath of the Khans",
        "description": "More military history. More quintessentially “Dan” twists. More deep questions. In this “Director’s Cut” style addendum to HH 47 you get all that, plus cutting-room floor stuff and Dan talking about the challenges this episode posed and why he made “Wrath of the Khans” the way he did."
    },
    {
        "pub-date": "22/04/2013",
        "episode": "48",
        "title": "Prophets of Doom",
        "description": "Murderous millennial preachers and prophets take over the German city of Munster after Martin Luther unleashes a Pandora’s Box of religious anarchy with the Protestant Reformation."
    },
    {
        "pub-date": "25/07/2013",
        "episode": "49",
        "title": "The American Peril",
        "description": "Imperial temptations and humanitarian nightmares force the United States of the late 19th Century to confront the contradictions between its revolutionary self-image and its expanding national interests."
    },
    {
        "pub-date": "29/10/2013",
        "episode": "50",
        "title": "Blueprint for Armageddon I",
        "description": "The planet hadn’t seen a major war between all the Great Powers since the downfall of Napoleon at Waterloo in 1815. But 99 years later the dam breaks and a Pandora’s Box of violence engulfs the planet."
    },
    {
        "pub-date": "30/01/2014",
        "episode": "51",
        "title": "Blueprint for Armageddon II",
        "description": "The Great Powers all come out swinging in the first round of the worst war the planet has ever seen. Millions of men in dozens of armies vie in the most deadly and complex opening moves of any conflict in world history."
    },
    {
        "pub-date": "24/04/2014",
        "episode": "52",
        "title": "Blueprint for Armageddon III",
        "description": "The war of maneuver that was supposed to be over quickly instead turns into a lingering bloody stalemate. Trench warfare begins, and with it, all the murderous efforts on both sides to overcome the static defenses."
    },
    {
        "pub-date": "17/08/2014",
        "episode": "53",
        "title": "Blueprint for Armageddon IV",
        "description": "Machine guns, barbed wire and millions upon millions of artillery shells create industrialized meat grinders at Verdun and the Somme. There’s never been a human experience like it…and it changes a generation."
    },
    {
        "pub-date": "30/12/2014",
        "episode": "54",
        "title": "Blueprint for Armageddon V",
        "description": "Politics, diplomacy, revolution and mutiny take center stage at the start of this episode, but mud, blood, shells and tragedy drown all by the end."
    },
    {
        "pub-date": "06/05/2015",
        "episode": "55",
        "title": "Blueprint for Armageddon VI",
        "description": "The Americans are coming, but will the war be over by the time they get there? Germany throws everything into a last series of stupendous attacks in the West while hoping to avoid getting burned by a fire in the East they helped fan."
    },
    {
        "pub-date": "29/10/2015",
        "episode": "56",
        "title": "Kings of Kings I",
        "description": "Often relegated to the role of slavish cannon fodder for Sparta’s spears, the Achaemenid Persian empire had a glorious heritage. Under a single king they created the greatest empire the world had ever seen."
    },
    {
        "pub-date": "20/03/2016",
        "episode": "57",
        "title": "Kings of Kings II",
        "description": "From Biblical-era coup conspiracies to the horrific aftermath of ancient combat this second installment of the series on the Kings of Achaemenid Persia goes where only Dan can take it. For better or worse…"
    },
    {
        "pub-date": "07/08/2016",
        "episode": "58",
        "title": "Kings of Kings III",
        "description": "If this were a movie, the events and cameos would be too numerous and star-studded to mention. It includes Xerxes, Spartans, Immortals, Alexander the Great, scythed chariots, and several of the greatest battles in history."
    },
    {
        "pub-date": "24/01/2017",
        "episode": "59",
        "title": "(BLITZ) The Destroyer of Worlds",
        "description": "What happens if human beings can’t handle the power of their own weaponry? This show  examines the dangerous early years of the Nuclear Age and humankind’s efforts to avoid self-destruction at the hands of its own creation."
    },
    {
        "pub-date": "10/08/2017",
        "episode": "60",
        "title": "The Celtic Holocaust",
        "description": "Julius Caesar is our travel guide as he takes us through his murderous subjugation of the native Celtic tribal peoples of ancient Gaul. It sounds vaguely like other, recent European colonial conquests...until the natives nearly win."
    },
    {
        "pub-date": "29/01/2018",
        "episode": "61",
        "title": "(BLITZ) Painfotainment",
        "description": "Pain is at the root of most drama and entertainment. When does it get too real? This very disturbing and graphic show looks into some case studies and asks some deep questions. WARNING: Very intense subject matter."
    },
    {
        "pub-date": "14/07/2018",
        "episode": "62",
        "title": "Supernova in the East I",
        "description": "The Asia-Pacific War of 1937-1945 has deep roots. It also involves a Japanese society that’s been called one of the most distinctive on Earth. If there were a Japanese version of Captain America, this would be his origin story."
    },
    {
        "pub-date": "12/01/2019",
        "episode": "63",
        "title": "Supernova in the East II",
        "description": "Deep themes run through this show, with allegations of Japanese war crimes and atrocities in China at the start leading to eerily familiar, almost modern questions over how the world should respond. And then Dec 7, 1941 arrives..."
    },
    {
        "pub-date": "24/10/2019",
        "episode": "64",
        "title": "Supernova in the East III",
        "description": "Japan's rising sun goes supernova and engulfs a huge area of Asia and the Pacific. A war without mercy begins to develop infusing the whole conflict with a savage vibe."
    },
    {
        "pub-date": "03/06/2020",
        "episode": "65",
        "title": "Supernova in the East IV",
        "description": "Coral Sea, Midway and Guadalcanal are three of the most famous battles of the Second World War. Together they will shift the momentum in the Pacific theater and usher in the era of modern naval and amphibious warfare."
    }
]